users/app/controllers/users_controller.rb

  def create
    begin
      @user = User.create!(params[:user])
---
INSERT INTO "users" ("created_at", "email", "guid", "last_login", "name", "password", "status", "updated_at") VALUES ('2011-01-11 08:23:52.572123', 'bj.neilsen@gmail.com', '525e9b42-26c7-7fab-f8fc-249f4c471a2a', NULL, 'BJ Neilsen', 'pass', 1, '2011-01-11 08:23:52.572123')